#+title: Code Snippets

#+startup: content

* Babel Template

#+HEADER: :flags --std=gnu++23
#+begin_src C++ :main no :results output :includes <iostream> <cstdint>

int main() {
    std::cout << "HI\n";
    return 0;
}

#+end_src

#+RESULTS:
: HI

* Inherit Using A::A

#+HEADER: :flags --std=gnu++23
#+begin_src C++ :main no :results output :includes <iostream> <cstdint>

struct A {
    using Natural = std::uint32_t;
};

struct B : public A {
    using A::A;
};

int main() {

    B::Natural n = 3;

    std::cout << "Natural value: " << n << std::endl;

    return 0;
}

#+end_src

#+RESULTS:
: Natural value: 3

* Const Ptr

#+HEADER: :flags --std=gnu++23
#+begin_src C++ :main no :results output :includes <iostream> <cstdint>

int main() {
    std::uint32_t a=3;
    std::uint32_t const *  c = &a;

    c[0] = 5; // illegal
    *c = 5;   // illegal
    return 0;
}

#+end_src

#+RESULTS:

* Operator*

#+HEADER: :flags --std=gnu++23
#+begin_src C++ :main no :results output :includes <iostream> <cstdint> <print>

struct A {
    A& operator*() {
        std::print("Operator*!");
        return *this;
    }
};

int main() {

    A a;
    *a;

    return 0;
}

#+end_src

#+RESULTS:
: Operator*!

* Array Size

#+HEADER: :flags --std=gnu++23
#+begin_src C++ :main no :results output :includes <iostream> <cstdint> <print>
#include <array>
#include <iostream>
 
int main()
{ 
    std::array<int, 4> nums{};
 
    std::cout << "nums contains " << nums.size() << " elements.\n";
}
#+end_src

#+RESULTS:
: nums contains 4 elements.

* Bitwise

#+HEADER: :flags --std=gnu++23
#+begin_src C++ :main no :results output :includes <iostream> <cstdint> <print>
#include <array>
#include <iostream>
 
int main()
{ 
    std::size_t v=1;

    std::print("Value lshift {}", v << sizeof(v)) * 8 - 1;
}
#+end_src

#+RESULTS:
: Value lshift 4



#+HEADER: :flags --std=gnu++23
#+begin_src C++ :main no :results output :includes <iostream> <cstdint> <print>
#include <array>
#include <iostream>
#include <bitset> 
#include <limits>

int main()
{
    std::bitset<64> bt {~(std::numeric_limits<std::size_t>::max() <<  4)};

    bt = ~(0ULL);

    std::cout << "Value: " << bt << std::endl;

}
#+end_src

#+RESULTS:
: Value: 1111111111111111111111111111111111111111111111111111111111111111

* Move/Copy semantics

#+HEADER: :flags --std=gnu++23
#+begin_src C++ :main no :results output :includes <iostream> <cstdint> <print>
#include <array>
#include <iostream>

struct Data {
    std::uint64_t value{0};

    Data()=default;

    Data(Data const & other) :
        value(other.value) {
        std::print("Data Copy constructor!\n");
    }

    Data(Data && other) :
        value(std::move(other.value)) {
        std::print("Data move constructor!\n");
        
    }

    Data & operator=(Data const & other) {
        if(this != &other) {
            value = other.value;

            std::print("Data Copy operator!\n");
        }
        return *this;
    }

    Data & operator=(Data && other) {
        if (this != & other) {
            value = other.value;
            other.value;

            std::print("Data move operator!\n");
        }
        return *this;
    }

    ~Data()=default;
};

class Container {
public:

    void Update(Data dt) {
        data_ = std::move(dt);
    }

    void UpdateMove(Data && dt) {
        data_ = std::move(dt);
    }

private:

    Data data_{};
    
};
 
int main()
{ 
    Data dt;
    dt.value=100;

    Container cntr{};

    std::print("Update container with moved data.\n");
    
    cntr.Update(std::move(dt));
}
#+end_src

#+RESULTS:
: Update container with moved data.
: Data move constructor!
: Data move operator!
